// C-style comments.
// First non-comment line must be the following:
#Product=Inkways
// Following lines are key-value pairs, stored by the program.
// A line beginning with the pound/sharp/hash sign # are
// used internally and are not actual language pieces.
#Name=English (United States)
// Version is the version of the language file - it does not
// have any effect other than identification, and does not
// need to be present.
#LangVersion=1
// SuppVersion is short for Supported Version, and denotes the version in which this
// language file was made for. Any other version running this file will throw an error.
#AppVersion=0.1.6
// Culture is the Windows culture ID for the language.
// This is REQUIRED to be set properly!
#Culture="en-us"
// These lines are not required, they are simply for identification
// purposes.
#Author="NotYoojun"
#AuthorContact="yoojun@inkore.net"

// Below this are the key-value pairs; ID=String
// Note that the quotes are not required, but may be used for readability purposes.
// Language developers should use this file, and not other languages, to determine the
// context in which the string is deriving - otherwise, you may lose accuracy of your
// translation over time (see TranslationParty).

C_OK="OK"
C_CANCEL="Cancel"
C_CLOSE="Close"
C_COPYTOCLIPBOARD="Copy to Clipboard"

M_LANGUAGE="Language"
M_LANGUAGE_DESCRIPTION="The UI like buttons and text will appear in this language"
M_THEMEMODE="Theme mode"
M_THEMEMODE_DESCRIPTION="Change ther colors that appear in this app"
M_LIGHT="Light"
M_DARK="Dark"
M_SYSDEFAULT="System default"
M_BACKDROP="Backdrop"
M_BACKDROP_DESCRIPTION="Let windows and surfaces appear transcluent"
M_NONE="None"
M_ACRYLIC="Acrylic"
M_MICA="Mica"
M_TABBED="Tabbed"
M_UISCALE="UI Scale"
M_UISCALE_DESCRIPTION="We don't recommend changing this unless the UI is way too small or big for you"
M_DEFAULTWITHBRACKETS="(Default)"
M_APPEARANCE="Appearance"
M_GENERAL="General"
M_AUTHOR="Author"
M_VERSION="Version"
M_APPLY="Apply"
M_OPEN="Open"
M_INSTALL="Install"
M_UPDATE="Update"
M_CURRENTVER="Current Version"
M_LATESTVER="Latest Version"
M_LATEST="Latest"
M_COMINGSOON="Coming Soon"
S_FILEINUSE="File is being used by another process"
S_COMINGSOON_INF="This feature will be available in the future."
S_INSTALL_FILEINUSE="Some files might be in use by another process, please close that process and then click OK to continue, or click Cancel to cancel the installation."
S_UNINSTALL_LAUNCHFAILED="An error occured when launching the uninstall program. Do you want to force delete the program? Do you want to force delete all the files? THis may cause unexpected issues."

M_STYLUSMODE="Stylus Mode"
M_PAGEMANIPULATIONS="Page Manipulation"
M_SHAPERECOGNITION="Shape Recognition"

M_SAVE="Save"
M_SAVEAS="Save As"
M_SAVEALL="Save All"
M_NEW="New"
M_OPEN="Open"
M_UNDO="Undo"
M_REDO="Redo"
M_CUT="Cut"
M_COPY="Copy"
M_PASTE="Paste"
M_DELETE="Delete"

M_NEWPAGE="New Page"
M_ZOOMIN="Zoom In"
M_ZOOMOUT="Zoom Out"
M_MOVEUP="Move Up"
M_MOVEDOWN="Move Down"
M_EXPORT="Export"
M_STACKVIEW="Stack View"
M_WRAPVIEW="Wrap View"

M_IWBLACKBOARD="Inkways Blackboard"
M_NEWDOC="New Document"
M_IWBBDESCRIPTION="Choose a color and tap Start!"
M_START="Start"
M_OPENFILE="Open File"
M_SETTINGS="Settings"
M_OPENIW="Open Inkways"
M_FULLSCREEN="Fullscreen"

M_JUSTEXIT="Just Exit"
M_SAVEANDEXIT="Save & Exit"
M_OPTIONS="Options"
M_DRAWONLYONCE="Draw only once"

M_ENTERNAME="Enter name"
M_BASIC="Basic"
M_SIZE="Size"
M_ADVANCED="Advanced"
M_COLOR="Color"
M_WIDTH="Width"
M_HEIGHT="Height"
M_SHAPE="Shape"
M_RECTANGLE="Rectangle"
M_ELLIPSE="Ellipse"
M_WEIGHT="Weight"
M_NONE="None"
M_CALCTAIL="Calculate Tail"
M_CALCSPEED="Calculate Speed"
M_HIGHLIGHTERMODE="Highlighter Mode"
M_FITTOCURVE="Fit to Curve"
M_IGNPRESSURE="Ignore Pressure"
M_PERCENTAGE="Percentage"
M_SELECTALL="Select All"
M_POINTERS="Point Erase"
M_STROKEERS="Stroke Erase"
M_APPLYSCALETOTIP="Apply scale to stylus tip"

M_PPTOOLBAR="PPT Toolbar"
M_EXITRAY="Exit Tray Icon"
M_BLACkBOARD="Blackboard"
M_NEWINDOW="New Window"

S_TOOMANYSESSIONS="You have opened too much documents in one process. Please close some unused ones or start a new instance."
S_TOOMANYDIALOGS="There is already a ContentDialog active, please close that before opening a new one."
S_SAVECHANGESTITLE="Save the changes?"
S_SAVECHANGES="You have a few changes in the document.\r\n\r\nShould these changes be saved now?\r\nYour changes will be lost if you dont save them."
M_DONTSAVE="Don't save"

M_WHITEBOARD169="Whiteboard (16:9)"
S_NEW_WHITEBOARD="Enjoy a landscape clear board for brainstorms, full-screen presentations and more!"
M_NOTEBOOK34="Notebook (3:4)"
S_NEW_NOTEBOOK="Pick up a page to write down some ideas, keep a diary, or review what you learned today."

S_NEW_TIPS="Tip: The preset you choose will only affect the page properties (size, background and patterns, etc). The two modes have excact same features and functions. You can always change the page properties later if you want."
M_CREATE="Create"
M_DOCNAMETIP="Document name..."

M_STARTPAGE="Start Page"
S_BLACKBOARD_CLEARWARNING="This action will delete all the strokes and elements on this page. If you want another clear page, please click the '>' button to add a new page. Would you like to continue?"
M_INNERBOARD="Innerboard"
M_STOPPRESENTATION="Stop Presentation"
M_HIDETOOLBARS="Hide Toolbars"
M_CLEAR="Clear"

M_BEHAVIOR="Behavior"
M_AUTOSTART="Auto Start"
M_AUTOSTART_DESCRIPTION="Start Inkways automatically when Windows starts"
M_STHWENTWRONG="Oops.. Something went wrong!"
S_OFFICENOTACTIVATED="It seems that your Microsoft Office hasn't been activated yet.\r\n\r\nWe recommend you to activate your Office first. Without activation, Inkways can't work with Microsoft PowerPoint."
M_GOBACK="Go back"
M_IGNORERISKY="Ignore (risky!!)"
M_CHANGEVALUE="Change value"

M_WELCOMETOIW="Welcome to Inkways"
M_OPENDOTS="Open..."
M_QUICKACCESS="Quick access"
M_RECENTLYOPENED="Recently opened"
M_FAVORITES="Favorites"
M_SHARED="Shared"
M_NOITEMS="No items"
M_BLACKBOARD="Blackboard"
M_ABOUT="About"

M_ROTATE45="Rotate 45°"
M_ROTATE90="Rotate 90°"
M_THICKNESSINCREASE="Increase Thickness"
M_THICKNESSDECREASE="Decrease Thickness"
M_ROTATE="Rotate"
M_FLIPV="Flip Vertically"
M_FLIPH="Flip Horizontally"
M_FLIP="Flip"
M_COLORS="Colors"
M_SLIDERS="Sliders"
M_MORE="More"
M_HIDE="Hide"

M_BRINGFORWARD="Bring Forward"
M_BRINGTOFRONT="Bring to Front"
M_SENDBACKWARD="Send Backward"
M_SENDTOBACK="Send to Back"
M_EDIT="Edit"
M_LOCK="Lock"
M_ADD="Add"
M_ELEMENTS="Elements"
M_ELEMENT="Element"
M_GADGETS="Gadgets"
M_GADGET="Gadget"
M_AUTO="Auto"
M_FITTOBOUNDS="Fit to Bounds"

M_ERASER="Eraser"
M_SHAPES="Shapes"
M_LASSO="Lasso"
M_HAND="Hand"
M_POINTER="Pointer"
M_WELCOME="Welcome"
M_REPLAY="Replay"
M_STARTREPLAY="Start replay"
M_STOPREPLAY="Stop replay"
M_INKOPTIONS="Ink Options"

M_DISMISS="Dismiss"
M_MOREINFO="More info"
S_EXTENSIONNOTFOUND="This element is from an extension that hasn't been installed in this computer yet. You need to install it to use this element.\r\n\r\nHowever, you can still move or delete, and the changes with its original data will be saved even if you don't install it. And it will show as soon as you install the specified extension. For more information, please click 'More info'."
M_PACKID="Package ID"
M_WEBSITE="Website"

M_CLOSEMENU="Close Menu"
M_BOLD="Bold"
M_ITALIC="Italic"
M_UNDERLINE="Underline"
M_STRIKETHROUGH="Strikethrough"
M_COLOR="Color"
M_CLEARSELECTION_SHORT="Clear"
M_INVERTSELECT_SHORT="Invert"
M_ALIGNLEFT="Align Left"
M_ALIGNCENTER="Align Center"
M_ALIGNRIGHT="Align Right"
M_ALIGNJUSTIFY="Align Justify"
M_SUBSCRIPT="Subscript"
M_SUPERSCRIPT="Superscript"
M_FORMAT="Format"

M_SCREENSHOT="Screenshot"
M_COLLAPSE="Collapse"
M_ANNOTATOR="Annotator"
M_VCAMERAKSK="Camera"
M_REFRESH="Refresh"
M_LAUNCH="Launch"
M_EDITOR="Editor"

S_ANNOTATORSTARTING="Inkways Annotator is starting. It will show up in a few seconds, now please wait and you can close this window."
M_EXIT="Exit"
M_IMPORT="Import"
M_CANTLOAD="Can't load"
M_ONLYHITFULLYINSIDE="Fully-inside elements only"
M_LASSOCANSELECTLOCKEDELEMENTS="Hit locked elements in lasso"
S_ASKREMOVEASYMPTOTE="Do you want to remove the asymptote?"
M_STRETCH_ORIGINAL="Original"
M_STRETCH_FILL="Fill"
M_STRETCH_UNIFORMTOFILL="UniformToFill"

M_UNDOANDREDO="Undo 'n Redo"
M_PAGELIST="Page List"
M_PAGENAVIGATION="Page Navigation"
M_SELECTBUTTONS="Select Buttons"
M_PREVIOUSPAGE="Previous Page"
M_NEXTPAGE="Next Page"

M_HIDETOOLBAR="Hide Toolbar"
M_DESELECT="Deselect"
M_SHOWGRID="Show Grid"
M_DYNAMICSCREEN="Dynamic Screen"
M_SAVEDOCUMENT="Save Document"
M_NOTHINGTOSAVE="Nothing to save"
S_NOTHINGTOSAVE_MSG="There is no content to save in this document."
M_STRETCH="Stretch"
M_SCALE="Scale"

M_WHITE="White"
M_GREEN="Green"
M_BLACK="Black"
M_LIGHTYELLOW="Light Yellow"
M_LIGHTGREEN="Light Green"
M_LIGHTPURPLE="Light Purple"
M_LIGHTGRAY="Light Gray"
M_GRAY="Gray"
M_DARKGREEN="Dark Green"
M_LIGHTBLUE="Light Blue"
M_LIGHTORANGE="Light Orange"
M_PINK="Pink"

M_COUNTDOWN="Countdown"
M_CALCULATOR="Calculator"
M_STOPWATCH="Stopwatch"
M_LAPSHARP="Lapsharp"
M_TIME="Time"
M_STOP="Stop"
M_LAP="Lap"

M_FUNCTION="Function"
M_IMAGE="Image"

M_MENTION="Mention"
M_EMOJI="Emoji"
M_TEXT="Text"